[
  {
    "id": "1",
    "image": "/images/paec.png",
    "title": "PAEC",
    "alt": "PAEC",
    "description": "M.R.S Enterprises has proudly collaborated with the Pakistan Atomic Energy Commission (PAEC), delivering top-tier industrial equipment, safety instruments, and technical solutions to support nuclear and energy sector projects. Our commitment to quality and precision ensures operational efficiency in highly sensitive environments, reinforcing our reputation as a trusted industrial supplier in Pakistan."
  },
  {
    "id": "2",
    "image": "/images/azkonobel.png",
    "title": "Akzo Nobel Pakistan",
    "alt": "Akzo Nobel Pakistan",
    "description": "M.R.S Enterprises provides Akzo Nobel Pakistan with high-grade industrial supplies, automation tools, and maintenance solutions. As a leading global brand in paints and coatings, Akzo Nobel relies on our reliable sourcing and technical expertise to maintain seamless production lines, high safety standards, and sustainable manufacturing in Pakistan’s chemical industry."
  },
  {
    "id": "3",
    "image": "/images/fauji.png",
    "title": "Fauji Cement",
    "alt": "Fauji Cement",
    "description": "Fauji Cement Company Limited has partnered with M.R.S Enterprises to enhance its manufacturing capabilities through durable mechanical equipment, electrical components, and industrial-grade materials. Our collaboration strengthens their infrastructure and supports efficient, high-volume cement production — a critical component of Pakistan’s construction and development sector."
  },
  {
    "id": "4",
    "image": "/images/fojifreshandfreeze.png",
    "title": "Fauji Fresh And Freeze",
    "alt": "Fauji Fresh And Freeze",
    "description": "At Fauji Fresh and Freeze, M.R.S Enterprises plays a vital role in supplying advanced automation systems, food-grade sensors, and hygienic industrial tools. Our products support strict quality control in cold chain logistics, helping maintain international food safety standards for one of Pakistan’s leading frozen food processing companies."
  }
]
